[
  {
    "id": 1,
    "title": "WebInventory",
    "tag": "Web",
    "overview": "Ce projet individuel avait pour objectif de créer un site permettant de stocker différents types de “trucs”, tels que des objets, des lieux, des personnes, des services ou des activités. L’idée était de proposer un outil capable de filtrer, rechercher et ajouter ces éléments dans une base de données. Le thème que j’ai choisi pour ce projet est celui d’un site de cuisine où je stockais dans une base de données des recettes.",
    "overview2": "Le projet comportait plusieurs fonctionnalités : une page d’accueil présentant le concept et les derniers “trucs” ajoutés, un moteur de recherche avec filtrage et tri des résultats en JavaScript, des informations détaillées pour chaque “truc”, ainsi qu’une page protégée par mot de passe pour ajouter de nouveaux éléments. Une page personnelle incluant les mentions légales et informations sur la propriété intellectuelle a également été réalisée.",
    "dates": "Février à Juin 2025 – BUT MMI1",
    "skills": "Rigueur, persévérance, autonomie, créativité.",
    "software": "HTML, CSS, JavaScript / PHP / MySQL",
    "context": "Le projet a été réalisé seul, dans un cadre universitaire, à partir des cours d’intégration web et de développement web, où nous avons appris à utiliser HTML, CSS, JavaScript et à manipuler des bases de données avec MySQL et PHP.",
    "link": "https://webinventory.te.projetsmmichamps.fr",
    "image": "images/Projets/SAE_203_-_WebInventory.webp"
  },
  {
    "id": 2,
    "title": "Echo Music",
    "tag": "Web",
    "overview": "Ce projet de site individuel avait pour objectif de créer une page web répertoriant cinq albums ou morceaux de musique que j’apprécie ou que je n’apprécie pas. L’idée était de présenter mes choix de manière claire et interactive, en intégrant un extrait audio de 15 secondes pour chaque morceau, ainsi qu’un lien vers une plateforme de streaming permettant d’écouter le morceau complet. Chaque morceau était accompagné d’une explication justifiant mon choix et d’images optimisées pour illustrer mes sélections.",
    "overview2": "Le site devait être one-page et optimisé pour un affichage sur des écrans de plus de 1024 pixels de large. Tous les fichiers ensemble ne devaient pas dépasser 10 Mo, ce qui m’a obligé à optimiser le poids des images et des extraits audio.",
    "dates": "2024-2025 – BUT MMI1",
    "skills": "Rigueur, patience, autonomie, créativité.",
    "software": "HTML, CSS, JavaScript, JSON",
    "context": "Ce projet, qui a été réalisé seul, s’inscrit dans le cadre universitaire, avec pour objectif de mettre en pratique les connaissances acquises lors des cours et des travaux pratiques. ",
    "link": "https://te.projetsmmichamps.fr/sae105/",
    "image": "images/Projets/SAE_105_-_Echo_Music.webp"
  },
  {
    "id": 3,
    "title": "Staytistics",
    "tag": "Web",
    "overview": "Ce projet avait pour objectif de créer une visualisation interactive de données sur l’évolution du nombre d’écoutes des albums et musiques du groupe Stray Kids. L’idée était de permettre aux visiteurs de comprendre rapidement et de manière visuelle comment la popularité des albums et des chansons a évolué dans le temps. Le site devait également proposer des informations complémentaires, et aussi de synthétiser les principaux constats réalisés à partir des données collectées par des API.",
    "overview2": "Pour rendre la visualisation plus attractive, le site intègre de l’interactivité, des animations et des éléments multimédias comme: des images, des extraits audio des musiques et des mini extraits vidéos des clips du groupe. Les utilisateurs peuvent explorer les données, observer les tendances et comparer les chiffres des différents albums et chansons.",
    "dates": "Septebmre à Novembre 2025 – BUT MMI2",
    "skills": "Analyse de données, design UX, développement web, utilisation d’API (Deezer, Kworb contenant des données de statistiques)",
    "software": "HTML, CSS, JavaScript, Chart.js",
    "context": "Projet universitaire, réalisé en binôme, visant à créer un site web interactif pour suivre et visualiser les écoutes musicales.",
    "link": "https://mmi-projets.github.io/Staytistics/",
    "image": "images/Projets/SAE_303_-_Staytistics.webp"
  },
  {
    "id": 4,
    "title": "En Vadrouille",
    "tag": "Web",
    "overview": "Ce projet consistait à réaliser un blog individuel permettant de partager et de décrire différentes activités réalisées à Paris. L’objectif principal était de créer un site où je pouvais publier mes sorties, ajouter des photos et donner mon avis sur chacune d’entre elles. Les visiteurs peuvent ainsi consulter les articles, découvrir de nouvelles activités et profiter d’un contenu enrichi par des médias visuels.",
    "overview2": "Le blog a été conçu de manière à différencier les utilisateurs logués et non logués. Les utilisateurs non logués peuvent lire les articles, sans pouvoir commenter, tandis que les utilisateurs logués peuvent commenter et interagir avec les publications. Chaque article affiche la date de publication et contient des images et des avis détaillés.",
    "dates": "Octobre à Novembre 2025 – BUT MMI2",
    "skills": "Créativité, organisation, développement web.",
    "software": "HTML, CSS, PHP, MySQL, Javascript",
    "context": "Projet universitaire, réalisé seul, visant à créer un blog fonctionnel pour partager des expériences et activités locales.",
    "link": "https://tp4-5-php.te.projetsmmichamps.fr/index.php",
    "image": "images/Projets/Projet_PHP_-_En_Vadrouille.webp"
  },
  {
    "id": 5,
    "title": "La Descente (Court métrage)",
    "tag": "Vidéo",
    "overview": "Ce projet collectif consistait à réaliser un court-métrage d’une durée maximale d’une minute trente, mettant en scène le passage d’un monde réel à un monde fictif. Le film débute par une situation ancrée dans la réalité, racontée par une voix off en français, avant de basculer dans un univers imaginaire à travers une incrustation dans une image existante. Ce changement de dimension est marqué à la fois par une transition visuelle créative et par un son spécialement conçu pour accompagner ce basculement. <br><br> Le court-métrage raconte l’histoire d’une personne vivant seule dans son appartement, confrontée à un son oppressant et mystérieux. Pour comprendre son origine, elle quitte son appartement et s’engage dans l’ascenseur, puis dans un étrange tunnel au décor organique et brumeux. Au bout de ce passage, elle découvre un énorme “cœur” qui s’anime et émet un flash lumineux intense, marquant l’apogée de cette expérience entre réalité et fiction.",
    "overview2": "Le tournage a été réalisé en groupe, tandis que le montage était individuel, ce qui m’a permis de proposer ma propre interprétation du projet à travers le montage, le rythme et le travail sonore. J’ai également enregistré ma propre voix off en anglais pour la partie fictive. Le projet m’a amené à travailler sur l’écriture du scénario, la narration, le sound design, le montage vidéo ainsi que l’incrustation et le tracking, en veillant à créer une cohérence entre l’image, le son et le récit.",
    "dates": "Octobre 2025 à Janvier 2026 – BUT MMI2",
    "skills": "Créativité, narration audiovisuelle, sound design, montage vidéo, travail en équipe.",
    "software": "Premiere Pro, After Effects, Audition / Reaper, caméra, stabilisateur Osmo.",
    "context": "Projet universitaire réalisé en groupe pour le tournage et individuellement pour le montage, ayant pour objectif d’explorer la narration audiovisuelle à travers le contraste entre réalité et fiction, en mettant le son au cœur du dispositif narratif.",
    "link": "https://youtu.be/kAsLaGKIKrU",
    "image": "images/Projets/SAE3.02_-_Court_metrage.webp"
  },
  {
    "id": 6,
    "title": "Affiche - Les Enjeux des IA Génératives",
    "tag": "Création",
    "overview": "Ce projet consistait à créer une affiche individuelle au format A3 portant sur l’impact environnemental des intelligences artificielles génératives. L’objectif principal était de sensibiliser le public sur les ressources matérielles limitées et utilisées par l’IA, en mettant en évidence la consommation d’électricité, la consommation d’eau et les émissions de CO₂ des centres de données. L’affiche devait être à la fois informative et visuellement impactante, afin de capter l’attention et susciter la réflexion.",
    "overview2": "Pour concevoir l’affiche, j’ai utilisé une métaphore visuelle représentant l’IA comme un organisme artificiel : une tête de robot au centre de l’affiche symbolise l’intelligence artificielle, avec des connexions visuelles illustrant la consommation d’électricité et d’eau. Les éléments textuels proviennent de ressources du cours sur les enjeux des IA génératives, et les images ont été soigneusement adaptées ou créées par moi-même. L’affiche intègre également les logos de l’Université Gustave Eiffel et du BUT MMI pour contextualiser le projet. Le rendu final visait à informer, alerter et questionner les visiteurs de la JPO sur l’impact environnemental réel des technologies d’IA.",
    "dates": "Janvier 2025 – BUT MMI2",
    "skills": "Illustration, rigueur, design graphique, créativité.",
    "software": "Photoshop",
    "context": "Projet universitaire individuel, réalisé dans le cadre d’un cours sur les enjeux des IA génératives, se concentrant sur la communication visuelle pour produire une affiche informative et esthétique.",
    "link": "images/Projets/Affiche_-_Les_Enjeux_des_IA_Generatives.jpg",
    "image": "images/Projets/Affiche_-_Les_Enjeux_des_IA_Generatives.webp"
  },
    {
    "id": 7,
    "title": "Au Hasard des Saveurs",
    "tag": "Web",
    "overview": "Ce projet collectif avait pour objectif de concevoir et développer une plateforme participative permettant aux utilisateurs de découvrir des recettes personnalisées selon leurs envies, leurs compétences culinaires et les ingrédients disponibles chez eux. L’idée était de transformer la frustration de manquer d’inspiration en une expérience simple, interactive et engageante, tout en valorisant le partage et la contribution des utilisateurs.",
    "overview2": "Le projet a débuté par une recherche utilisateur approfondie, avec interviews et création de personas, pour identifier les besoins de deux types d’utilisateurs principaux : ceux qui cherchent rapidité et simplicité et ceux qui veulent partager et explorer des expériences culinaires. Nous avons réalisé des wireframes, testé des parcours utilisateurs, puis construit une maquette finale sur Figma, intégrant des fonctionnalités telles que questionnaire dynamique, profils contributeurs, likes, favoris, historique et recommandations personnalisées. Chaque choix de design et de parcours a été pensé pour offrir une expérience fluide et intuitive.",
    "dates": "Septembre 2025 à Janvier 2026 – BUT MMI2",
    "skills": "UX/UI design, recherche utilisateur, prototypage, développement front-end et back-end, gestion de projet, travail en équipe, accessibilité web.",
    "software": "Figma, HTML, CSS, JavaScript, PHP, MySQL, Looping",
    "context": "Projet universitaire réalisé en équipe, visant à concevoir une expérience utilisateur complète autour de la découverte culinaire. Le projet a permis d’appliquer des compétences en design, développement et gestion de projet, tout en respectant les standards web et les bonnes pratiques Opquast, avec un hébergement en ligne et un nom de domaine dédié.",
    "link": "https://au-hasard-des-saveurs.acfiol.fr/",
    "image": "images/Projets/SAE_301_-_Au_Hasard_des_Saveurs.webp"
  },
  {
    "id": 8,
    "title": "Interview Journaliste",
    "tag": "Vidéo",
    "overview": "Dans le cadre de ce projet, j’ai réalisé, avec mon groupe, une interview d’un journaliste du Figaro. L’objectif était de découvrir le fonctionnement d’une rédaction d’information, comprendre les enjeux du métier et présenter ces éléments de manière claire et compréhensible. Le projet m’a permis de mettre en pratique des compétences en contact professionnel, préparation de questions, prise de vue et gestion d’une interview, tout en intégrant des séquences en anglais pour travailler la communication dans une langue étrangère.",
    "overview2": "Le projet s’est déroulé en plusieurs étapes : nous avons d’abord contacté le journaliste, préparé un questionnaire réfléchi pour obtenir des réponses pertinentes et originales, puis organisé le tournage de l’interview. Chaque membre du groupe a contribué au montage final et a participé à la gestion de l’image et du son. Mon rôle a inclus la rédaction des questions, la coordination avec le journaliste et l’enregistrement de certaines séquences. Cette expérience m’a permis de développer des compétences en communication professionnelle, travail collectif, technique audiovisuelle et narration orale.",
    "dates": "Octobre 2025 à Janvier 2026 – BUT MMI1",
    "skills": "Contact professionnel, interview journalistique, scénario d’interview, cadrage, montage vidéo, gestion du son, travail en équipe, communication en anglais.",
    "software": "Adobe Premiere Pro, Adobe Audition, caméra, micro, éclairage, trépied",
    "context": "Projet universitaire réalisé en groupe, ayant pour objectif de comprendre et présenter le fonctionnement d’une rédaction d’information à travers une interview. L’expérience a permis de combiner travail technique, préparation en amont et communication avec un professionnel, tout en mettant en valeur les apprentissages liés à l’audiovisuel et à la langue anglaise.",
    "link": "https://youtu.be/clxwBRrWQ3I",
    "image": "images/Projets/SAE1.04_-_Interview.webp"
  },
  {
    "id": 9,
    "title": "Art Science Factory - Projet Citoyen",
    "tag": "Web",
    "overview": "Ce projet collectif consistait à analyser et refondre la communication d’ArtScience Factory, une association qui promeut la recherche scientifique en lien avec l’art et l’innovation. Le travail portait sur l’audit des outils existants, l’étude des publics et la définition d’une direction artistique cohérente pour la communication digitale. L’objectif principal était de créer un site web clair, fonctionnel et moderne, permettant à l’association de diffuser ses événements et contenus de manière efficace et accessible.",
    "overview2": "Le projet a été mené en équipe, ce qui a permis de répartir les tâches entre analyse, design et développement web. Nous avons réalisé la refonte complète du site sur WordPress, en configurant les rôles utilisateurs, en choisissant les extensions adaptées et en intégrant des éléments graphiques représentant l’univers scientifique et artistique de l’association. Ce travail nous a permis de développer des compétences en UX/UI, gestion de contenus, design graphique et travail collaboratif.",
    "dates": "Janvier à Juin 2025 – BUT MMI1",
    "skills": "Communication digitale, UX/UI, WordPress, gestion de contenu, design graphique, travail en équipe, gestion de projet.",
    "software": "WordPress, Figma, Photoshop, Illustrator",
    "context": "Projet réalisé en groupe avec pour objectif de moderniser la communication digitale d’une association culturelle et scientifique. Le projet impliquait la conception, le développement et l’optimisation d’un site web pour améliorer la visibilité, l’expérience utilisateur et la gestion des contenus, tout en respectant la direction artistique et l’identité de l’association.",
    "link": "https://artsciencefactory.lin.projetsmmichamps.fr/",
    "image": "images/Projets/SAE_2.02_-_Projet_Citoyen_-_Art_Science_Factory.webp"
  },
    {
    "id": 10,
    "title": "Interstellar – Livret de présentation",
    "tag": "Création",
    "overview": "Pour ce projet, j’ai réalisé tout seul un livret de présentation du film Interstellar, destiné à être consulté sur écran et imprimé sur papier. L’objectif était de produire un document complet et visuellement attrayant, combinant analyse filmique, éléments graphiques et contenus textuels. Le livret présente le film de manière pédagogique et informative, comme s’il devait être proposé à des enseignants de lycée souhaitant valoriser le film auprès de leurs élèves.",
    "overview2": "Le livret inclut une analyse approfondie de séquences clés, illustrant l’évolution psychologique des personnages principaux. J’ai intégré des schémas détaillant le positionnement de la caméra et ses mouvements pour chaque scène analysée. Les personnages sont également présentés visuellement à travers des images détourées et accompagnés de descriptions psychologiques précises. Ce travail m’a permis de combiner compétences en conception graphique et en narration visuelle.",
    "dates": "Novembre à Décembre 2024 – BUT MMI1",
    "skills": "Analyse filmique, conception graphique, mise en page, narration visuelle, Adobe InDesign, gestion des images, optimisation pour impression et écran.",
    "software": "Adobe InDesign, Photoshop",
    "context": "Projet individuel visant à concevoir un livret de présentation du film Interstellar, avec analyse filmique, présentation des personnages et mise en page optimisée pour écran et impression.",
    "link": "docs/ecran-Livret.pdf",
    "image": "images/Projets/SAE_1.04_-_Livret_de_presentation.webp"
  }
]
